mbriday/qemu/include/hw/arm/stm32f303_soc.h
/*
 * STM32F303 SoC
 * Copyright (c) 2020 M. Briday <mikael.briday@ls2n.fr>
 *
 * based on STM32F405 SoC
 * Copyright (c) 2014 Alistair Francis <alistair@alistair23.me>
 *
 * Permission is hereby granted, free of charge, to any person obtaining a copy
 * of this software and associated documentation files (the "Software"), to deal
 * in the Software without restriction, including without limitation the rights
 * to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
 * copies of the Software, and to permit persons to whom the Software is
 * furnished to do so, subject to the following conditions:
 *
 * The above copyright notice and this permission notice shall be included in
 * all copies or substantial portions of the Software.
 *
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL
 * THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
 * LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
 * OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN
 * THE SOFTWARE.
 */

#ifndef HW_ARM_STM32F303_SOC_H
#define HW_ARM_STM32F303_SOC_H

#include "hw/misc/stm32f4xx_syscfg.h"
#include "hw/timer/stm32f3xx_timer.h"
#include "hw/char/stm32f2xx_usart.h"
#include "hw/adc/stm32f3xx_adc.h"
#include "hw/misc/stm32f4xx_exti.h"
#include "hw/gpio/stm32f3xx_gpio.h"
#include "hw/char/stm32f3xx_dummy_uart.h"
#include "hw/misc/stm32f3xx_rcc.h"
#include "hw/or-irq.h"
#include "hw/ssi/stm32f3xx_spi_mcp27S17.h"
#include "hw/arm/armv7m.h"

#define TYPE_STM32F303_SOC "stm32f303-soc"
#define STM32F303_SOC(obj) \
    OBJECT_CHECK(STM32F303State, (obj), TYPE_STM32F303_SOC)

//#define STM_NUM_USARTS 7
#define STM_NUM_TIMERS 6
#define STM_NUM_ADCS   2
#define STM_NUM_SPIS   1
#define STM_NUM_GPIOS  5
#define STM_NUM_UARTS  1

#define FLASH_BASE_ADDRESS 0x08000000 
#define FLASH_SIZE (1024 * 1024)     /* in fact 64k */
#define SRAM_BASE_ADDRESS 0x20000000
#define SRAM_SIZE (192 * 1024)       /* in fact 12K */


typedef struct STM32F303State {
    /*< private >*/
    SysBusDevice parent_obj;
    /*< public >*/

    char *cpu_type;

    ARMv7MState armv7m;

    STM32F4xxSyscfgState syscfg;
    STM32F4xxExtiState exti;
    //STM32F2XXUsartState usart[STM_NUM_USARTS];
    STM32F3XXTimerState timer[STM_NUM_TIMERS];
    qemu_or_irq adc_irqs;
    STM32F3XXADCState adc[STM_NUM_ADCS];
    STM32F3XXSPIState spi[STM_NUM_SPIS];
    STM32F3XXGPIOState gpio[STM_NUM_GPIOS];
    STM32F3XXDUMMY_UARTState uart[STM_NUM_UARTS];
    STM32F3XXRCCState rcc;

    MemoryRegion sram;
    MemoryRegion flash;
    MemoryRegion flash_alias;
} STM32F303State;

#endif
